---
kind: type
id: T:Autodesk.Revit.DB.HostObjAttributes
source: html/a3d349c5-d457-3b56-eec4-c2fa2757c860.htm
---
# Autodesk.Revit.DB.HostObjAttributes

An object that represents characteristics of several kinds of type.

## Syntax (C#)
```csharp
public class HostObjAttributes : ElementType
```

## Remarks
This object provides access to structural layering components for any object
derived from it, such as wall types and floor types.